In [1]:
import pandas as pd

In [2]:
#help(pd.DataFrame())

In [3]:
df1 = pd.DataFrame({ 'Names': ['Simon', 'Kate', 'Francis', 'Laura', 'Mary', 'Julian', 'Rosie'],
                   'Height':[180, 165, 170, 164, 163, 175, 166],
                   'Weight': [85, 65, 68, 45, 43, 72, 46],
                   'Pref_food': ['steak', 'pizza', 'pasta', 'pizza', 'vegetables', 'steak', 'seafood'],
                   'Sex': ['m', 'f', 'm', 'f', 'f', 'm', 'f']})

In [4]:
df1

     Names  Height  Weight   Pref_food Sex
0    Simon     180      85       steak   m
1     Kate     165      65       pizza   f
2  Francis     170      68       pasta   m
3    Laura     164      45       pizza   f
4     Mary     163      43  vegetables   f
5   Julian     175      72       steak   m
6    Rosie     166      46     seafood   f

### describe our data using .decribe()

In [5]:
df1.describe()

           Height     Weight
count    7.000000   7.000000
mean   169.000000  60.571429
std      6.377042  16.154021
min    163.000000  43.000000
25%    164.500000  45.500000
50%    166.000000  65.000000
75%    172.500000  70.000000
max    180.000000  85.000000

### Get variables ( columns) using .columns

In [6]:
df1.columns

Index(['Names', 'Height', 'Weight', 'Pref_food', 'Sex'], dtype='object')

### Set the names column as index

In [7]:
df1.set_index('Names')

         Height  Weight   Pref_food Sex
Names
Simon       180      85       steak   m
Kate        165      65       pizza   f
Francis     170      68       pasta   m
Laura       164      45       pizza   f
Mary        163      43  vegetables   f
Julian      175      72       steak   m
Rosie       166      46     seafood   f

### to consolidate index use inplace = True when setting index

In [8]:
df1.set_index('Names', inplace=True)

In [9]:
df1

         Height  Weight   Pref_food Sex
Names
Simon       180      85       steak   m
Kate        165      65       pizza   f
Francis     170      68       pasta   m
Laura       164      45       pizza   f
Mary        163      43  vegetables   f
Julian      175      72       steak   m
Rosie       166      46     seafood   f

### reset index using reset_index() method

In [10]:
df1.reset_index()

     Names  Height  Weight   Pref_food Sex
0    Simon     180      85       steak   m
1     Kate     165      65       pizza   f
2  Francis     170      68       pasta   m
3    Laura     164      45       pizza   f
4     Mary     163      43  vegetables   f
5   Julian     175      72       steak   m
6    Rosie     166      46     seafood   f

### check the number of variables and cases

In [11]:
df1.shape

(7, 4)

In [12]:
print(df1.dtypes)

Height        int64
Weight        int64
Pref_food    object
Sex          object
dtype: object

In [13]:
df1.head()

         Height  Weight   Pref_food Sex
Names
Simon       180      85       steak   m
Kate        165      65       pizza   f
Francis     170      68       pasta   m
Laura       164      45       pizza   f
Mary        163      43  vegetables   f

In [14]:
df1.tail(3)

        Height  Weight   Pref_food Sex
Names
Mary       163      43  vegetables   f
Julian     175      72       steak   m
Rosie      166      46     seafood   f

In [15]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 7 entries, Simon to Rosie
Data columns (total 4 columns):
Height       7 non-null int64
Weight       7 non-null int64
Pref_food    7 non-null object
Sex          7 non-null object
dtypes: int64(2), object(2)
memory usage: 280.0+ bytes

### rearrange data frame by a variable

In [16]:
df1.sort_values(by ='Weight')

         Height  Weight   Pref_food Sex
Names
Mary        163      43  vegetables   f
Laura       164      45       pizza   f
Rosie       166      46     seafood   f
Kate        165      65       pizza   f
Francis     170      68       pasta   m
Julian      175      72       steak   m
Simon       180      85       steak   m

### sort descending

In [17]:
df1.sort_values(by ='Weight', ascending = False)

         Height  Weight   Pref_food Sex
Names
Simon       180      85       steak   m
Julian      175      72       steak   m
Francis     170      68       pasta   m
Kate        165      65       pizza   f
Rosie       166      46     seafood   f
Laura       164      45       pizza   f
Mary        163      43  vegetables   f

### Slice Dataframe

In [18]:
df1[:3]

         Height  Weight Pref_food Sex
Names
Simon       180      85     steak   m
Kate        165      65     pizza   f
Francis     170      68     pasta   m

In [19]:
df1[4:]

        Height  Weight   Pref_food Sex
Names
Mary       163      43  vegetables   f
Julian     175      72       steak   m
Rosie      166      46     seafood   f

In [20]:
df1 = df1.reset_index()

In [21]:
df1['Names']

0      Simon
1       Kate
2    Francis
3      Laura
4       Mary
5     Julian
6      Rosie
Name: Names, dtype: object

In [22]:
df1.Names

0      Simon
1       Kate
2    Francis
3      Laura
4       Mary
5     Julian
6      Rosie
Name: Names, dtype: object

### Use double square bracket to select data frame

In [23]:
df1[['Names']]

     Names
0    Simon
1     Kate
2  Francis
3    Laura
4     Mary
5   Julian
6    Rosie

### Select more columns

In [24]:
df1[['Names', 'Sex']]

     Names Sex
0    Simon   m
1     Kate   f
2  Francis   m
3    Laura   f
4     Mary   f
5   Julian   m
6    Rosie   f

### Select value of particular variable

In [25]:
df1['Sex'][2] #Third value of 'Sex'

'm'

In [26]:
df1['Names'][1:4]

1       Kate
2    Francis
3      Laura
Name: Names, dtype: object

### Select items using loc (.loc walks throuh an index)

In [27]:
df1.loc[1] #Item at Index 1

Names         Kate
Height         165
Weight          65
Pref_food    pizza
Sex              f
Name: 1, dtype: object

In [28]:
df1.loc[:3] #Extract Items from index 0 to 3

     Names  Height  Weight Pref_food Sex
0    Simon     180      85     steak   m
1     Kate     165      65     pizza   f
2  Francis     170      68     pasta   m
3    Laura     164      45     pizza   f

### Using .iloc

In [29]:
df1.iloc[0,2] #get item with index 0 in dataframe and pull second index from he result

85

#### Alternative to iloc is .iat

In [30]:
df1.iat[1, 3] #should be pizza

'pizza'

### alternative is .at

In [31]:
df1.at[2, 'Sex']

'm'

### Use slicing

In [32]:
df1[::2] #Extract every other

     Names  Height  Weight   Pref_food Sex
0    Simon     180      85       steak   m
2  Francis     170      68       pasta   m
4     Mary     163      43  vegetables   f
6    Rosie     166      46     seafood   f

### Using boolean expressions

In [33]:
df1[df1['Height'] > 170] # Same as df1[df1.Height > 170]

    Names  Height  Weight Pref_food Sex
0   Simon     180      85     steak   m
5  Julian     175      72     steak   m

### Apply multiple booleans

In [34]:
df1[(df1.Height > 163) & (df1.Sex == 'f')]

   Names  Height  Weight Pref_food Sex
1   Kate     165      65     pizza   f
3  Laura     164      45     pizza   f
6  Rosie     166      46   seafood   f

### Rename columns

In [35]:
df1 = df1.rename(columns= {'Pref_food': 'Food'})

In [36]:
df1.head(2)

   Names  Height  Weight   Food Sex
0  Simon     180      85  steak   m
1   Kate     165      65  pizza   f

### Create a copy of data frame with .copy()

In [37]:
df2 = df1.copy()

In [38]:
df2.head()

     Names  Height  Weight        Food Sex
0    Simon     180      85       steak   m
1     Kate     165      65       pizza   f
2  Francis     170      68       pasta   m
3    Laura     164      45       pizza   f
4     Mary     163      43  vegetables   f

### adding a new column of data based on existing

In [39]:
df2['new_col'] = df2.Height/ 100

In [40]:
df2

     Names  Height  Weight        Food Sex  new_col
0    Simon     180      85       steak   m     1.80
1     Kate     165      65       pizza   f     1.65
2  Francis     170      68       pasta   m     1.70
3    Laura     164      45       pizza   f     1.64
4     Mary     163      43  vegetables   f     1.63
5   Julian     175      72       steak   m     1.75
6    Rosie     166      46     seafood   f     1.66

### using insert to add columns

In [41]:
df2.insert(5, column= 'new_col2', value = df2.Height / 1000 ) # add column at column index 5

In [42]:
df2

     Names  Height  Weight        Food Sex  new_col2  new_col
0    Simon     180      85       steak   m     0.180     1.80
1     Kate     165      65       pizza   f     0.165     1.65
2  Francis     170      68       pasta   m     0.170     1.70
3    Laura     164      45       pizza   f     0.164     1.64
4     Mary     163      43  vegetables   f     0.163     1.63
5   Julian     175      72       steak   m     0.175     1.75
6    Rosie     166      46     seafood   f     0.166     1.66

### Aggregate Dataset

In [43]:
df1.groupby('Sex')

In [44]:
grouped1 = df1.groupby('Sex')

In [45]:
grouped1.groups

{'f': Int64Index([1, 3, 4, 6], dtype='int64'),
 'm': Int64Index([0, 2, 5], dtype='int64')}

In [47]:
for names, groups in grouped1:
    print(names)
    print(groups)

f
   Names  Height  Weight        Food Sex
1   Kate     165      65       pizza   f
3  Laura     164      45       pizza   f
4   Mary     163      43  vegetables   f
6  Rosie     166      46     seafood   f
m
     Names  Height  Weight   Food Sex
0    Simon     180      85  steak   m
2  Francis     170      68  pasta   m
5   Julian     175      72  steak   m

### Get data from a group created by group by

In [48]:
grouped1.get_group('f')

   Names  Height  Weight        Food Sex
1   Kate     165      65       pizza   f
3  Laura     164      45       pizza   f
4   Mary     163      43  vegetables   f
6  Rosie     166      46     seafood   f

### Aggregate using two variables

In [51]:
grouped2 = df1.groupby(['Sex', 'Food'])

In [52]:
grouped2.groups

{('f', 'pizza'): Int64Index([1, 3], dtype='int64'),
 ('f', 'seafood'): Int64Index([6], dtype='int64'),
 ('f', 'vegetables'): Int64Index([4], dtype='int64'),
 ('m', 'pasta'): Int64Index([2], dtype='int64'),
 ('m', 'steak'): Int64Index([0, 5], dtype='int64')}

### Count data in a group

In [53]:
grouped2.size()

Sex  Food
f    pizza         2
     seafood       1
     vegetables    1
m    pasta         1
     steak         2
dtype: int64

### get descriptive data in Groups

In [55]:
grouped2.describe()

               Height                                                        \
                count   mean       std    min     25%    50%     75%    max
Sex Food
f   pizza         2.0  164.5  0.707107  164.0  164.25  164.5  164.75  165.0
    seafood       1.0  166.0       NaN  166.0  166.00  166.0  166.00  166.0
    vegetables    1.0  163.0       NaN  163.0  163.00  163.0  163.00  163.0
m   pasta         1.0  170.0       NaN  170.0  170.00  170.0  170.00  170.0
    steak         2.0  177.5  3.535534  175.0  176.25  177.5  178.75  180.0

               Weight
                count  mean        std   min    25%   50%    75%   max
Sex Food
f   pizza         2.0  55.0  14.142136  45.0  50.00  55.0  60.00  65.0
    seafood       1.0  46.0        NaN  46.0  46.00  46.0  46.00  46.0
    vegetables    1.0  43.0        NaN  43.0  43.00  43.0  43.00  43.0
m   pasta         1.0  68.0        NaN  68.0  68.00  68.0  68.00  68.0
    steak         2.0  78.5   9.192388  72.0  75.25  78.5  81.75  85.0

### variable frequency

In [56]:
df1['Sex'].value_counts()

f    4
m    3
Name: Sex, dtype: int64

In [57]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
Names     7 non-null object
Height    7 non-null int64
Weight    7 non-null int64
Food      7 non-null object
Sex       7 non-null object
dtypes: int64(2), object(3)
memory usage: 408.0+ bytes

### change variable type using .astype

In [58]:
df1['Weight'] = df1['Weight'].astype('object')

In [59]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
Names     7 non-null object
Height    7 non-null int64
Weight    7 non-null object
Food      7 non-null object
Sex       7 non-null object
dtypes: int64(1), object(4)
memory usage: 408.0+ bytes

### delete cases and variables using drop

In [61]:
df1.drop(0) #drop row 0

     Names  Height Weight        Food Sex
1     Kate     165     65       pizza   f
2  Francis     170     68       pasta   m
3    Laura     164     45       pizza   f
4     Mary     163     43  vegetables   f
5   Julian     175     72       steak   m
6    Rosie     166     46     seafood   f

In [63]:
df1.set_index('Names', inplace=True)

In [64]:
df1

         Height Weight        Food Sex
Names
Simon       180     85       steak   m
Kate        165     65       pizza   f
Francis     170     68       pasta   m
Laura       164     45       pizza   f
Mary        163     43  vegetables   f
Julian      175     72       steak   m
Rosie       166     46     seafood   f

In [65]:
df1.drop('Laura')

         Height Weight        Food Sex
Names
Simon       180     85       steak   m
Kate        165     65       pizza   f
Francis     170     68       pasta   m
Mary        163     43  vegetables   f
Julian      175     72       steak   m
Rosie       166     46     seafood   f

### remove more than 1 element

In [67]:
print(df1.drop(['Mary', 'Francis']))

        Height Weight     Food Sex
Names
Simon      180     85    steak   m
Kate       165     65    pizza   f
Laura      164     45    pizza   f
Julian     175     72    steak   m
Rosie      166     46  seafood   f

### Remove an entire column by specifying axis

In [71]:
df1.drop('Height', axis = 1) #Default axis is 0 indicating the rows

        Weight        Food Sex
Names
Simon       85       steak   m
Kate        65       pizza   f
Francis     68       pasta   m
Laura       45       pizza   f
Mary        43  vegetables   f
Julian      72       steak   m
Rosie       46     seafood   f

## Remove multiple columns by including them in list

In [75]:
df1.drop(['Height', 'Weight'], axis=1)

               Food Sex
Names
Simon         steak   m
Kate          pizza   f
Francis       pasta   m
Laura         pizza   f
Mary     vegetables   f
Julian        steak   m
Rosie       seafood   f

### Specify Columns instead when dropping instead of axis = 1

In [78]:
df1.drop(['Height', 'Weight'], axis='columns')

               Food Sex
Names
Simon         steak   m
Kate          pizza   f
Francis       pasta   m
Laura         pizza   f
Mary     vegetables   f
Julian        steak   m
Rosie       seafood   f

### use crosstable to create correlations

In [79]:
pd.crosstab(df1.Sex, df1.Food)

Food  pasta  pizza  seafood  steak  vegetables
Sex
f         0      2        1      0           1
m         1      0        0      2           0

### When we add margins parameter we can get row totals

In [80]:
pd.crosstab(df1.Sex, df1.Food, margins=True)

Food  pasta  pizza  seafood  steak  vegetables  All
Sex
f         0      2        1      0           1    4
m         1      0        0      2           0    3
All       1      2        1      2           1    7